jack77er/openUTRUSTA/Packages/.cache/Keil.LPC4000_DFP.1.1.0.pdsc
        <!-- *************************  Device 'LPC4078FET208'  ***************************** -->
        <device Dname="LPC4078FET208">
          <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
          <compile header="Device\Include\LPC407x_8x_177x_8x.h"  define="CORE_M4"/>
          <debug      svd="SVD\LPC408x_7x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="MemoryOther"   n="1"                           name="4032 Bytes EEPROM"/>
          <feature type="ETH"           n="1"       m="100000000"/>
          <feature type="USBOTG"        n="1"/>
          <feature type="UART"          n="5"/>
          <feature type="PWM"           n="6"/>
          <feature type="BGA"           n="208"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC408x'  **************************** -->
      <subFamily DsubFamily="LPC408x">
        <book       name="Documents\UM10562.pdf"                          title="LPC4000 Series Reference Manual"/>
        <book       name="Documents\LPC408X_7X_DS.pdf"                    title="LPC4000 Series Datasheet"/>
        <book       name="Documents\LPC407X_8X_ES.pdf"                    title="LPC4000 Series Erratasheet"/>

        <feature type="MemoryOther"   n="1"                           name="4032 Bytes EEPROM"/>
        <feature type="GLCD"          n="1"       m="1024.768"        name="LCD Controller (1024x768x24) for STN and TFT"/>
        <feature type="ETH"           n="1"       m="100000000"/>
        <feature type="USBOTG"        n="1"/>
        <feature type="UART"          n="5"/>
        <feature type="PWM"           n="6"/>

        <!-- *************************  Device 'LPC4088FBD144'  ***************************** -->
        <device Dname="LPC4088FBD144">
          <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
          <compile header="Device\Include\LPC407x_8x_177x_8x.h"  define="CORE_M4"/>
          <debug      svd="SVD\LPC408x_7x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="QFP"           n="144"/>
        </device>

        <!-- *************************  Device 'LPC4088FBD208'  ***************************** -->
        <device Dname="LPC4088FBD208">
          <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
          <compile header="Device\Include\LPC407x_8x_177x_8x.h"  define="CORE_M4"/>
          <debug      svd="SVD\LPC408x_7x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="QFP"           n="208"/>
        </device>

        <!-- *************************  Device 'LPC4088FET180'  ***************************** -->
        <device Dname="LPC4088FET180">
          <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
          <compile header="Device\Include\LPC407x_8x_177x_8x.h"  define="CORE_M4"/>
          <debug      svd="SVD\LPC408x_7x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="BGA"           n="180"/>
        </device>

        <!-- *************************  Device 'LPC4088FET208'  ***************************** -->
        <device Dname="LPC4088FET208">
          <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
          <compile header="Device\Include\LPC407x_8x_177x_8x.h"  define="CORE_M4"/>
          <debug      svd="SVD\LPC408x_7x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="BGA"           n="208"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="LPC4000">
      <description>NXP LPC4000 Series devices</description>
      <require Dvendor="NXP:11" Dname="LPC40??*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="LPC4000 CMSIS">
      <!-- conditions selecting Devices -->
      <description>NXP LPC4000 Series devices and CMSIS-CORE</description>
      <require condition="LPC4000"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup LPC4000 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC4000 CMSIS">
      <description>System Startup for NXP LPC4000 Series</description>
      <files>
        <!-- include folder / file -->
        <file category="header" name="Device\Include\LPC407x_8x_177x_8x.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_LPC407x_8x_177x_8x.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_LPC407x_8x_177x_8x.c"       attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>
</package>
